Repository: atkins126/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/regular_expressions.po
Languages: ru

source: Treat string as multiple lines. So ``^`` and ``$`` matches the start or end of any line anywhere within the string.
ru: Обрабатывать строку как несколько строк. Таким образом, ``^`` и ``$`` соответствуют началу или концу любой строки в любом месте строки.

source: See also `Line Boundaries <#lineseparators>`__.
ru: Смотрите также `Разделители строк <#lineseparators>`__.

source: s, single line strings
ru: s, одиночные строки

source: Treat string as single line. So ``.`` matches any character whatsoever, even a line separators.
ru: Обрабатывать строку как одну строку. Так что ``.`` соответствует любому символу, даже разделителям строк.

source: See also `Line Boundaries <#lineseparators>`__, which it normally would not match.
ru: Смотрите также `Разделители строк <#lineseparators>`__, которые обычно не совпадают.

source: g, greediness
ru: г, жадность

source: `TRegExpr <tregexpr.html>`__ only modifier.
ru: Специфичный для `TRegExpr <tregexpr.html>`__ модификатор.

source: Switching it ``Off`` you’ll switch `quantifiers <#iterator>`__ into `non-greedy <#greedy>`__ mode.
ru: Отключив его ``Off``, вы переключите `повторитель <#iterator>`__ в `не-жадный <#greedy>`__ режим.

source: So, if modifier ``/g`` is ``Off`` then ``+`` works as ``+?``, ``*`` as ``*?`` and so on.
ru: Итак, если модификатор ``/g`` имеет значение ``Off``, то ``+`` работает как ``+?``, ``*`` как ``*?`` и так далее.

source: By default this modifier is ``On``.
ru: По умолчанию этот модификатор имеет значение ``Выкл``.

source: x, eXtended syntax
ru: x, расширенный синтаксис

source: Allows to comment regular expression and break them up into multiple lines.
ru: Позволяет комментировать регулярные выражения и разбивать их на несколько строк.

source: If the modifier is ``On`` we ignore all whitespaces that is neither backslashed nor within a character class.
ru: Если модификатор включен, мы игнорируем все пробелы, которые не заэскейплены обратной косой чертой, и не включены в класс символов.

source: And the ``#`` character separates comments.
ru: Также символ ``#`` отделяет комментарии.

source: Notice that you can use empty lines to format regular expression for better readability:
ru: Обратите внимание, что вы можете использовать пустые строки для форматирования регулярного выражения для лучшей читаемости:

source: ( (abc) # comment 1 # (efg) # comment 2 )
ru: ( (abc) # комментарий 1 # (efg) # комментарий 2 )

source: This also means that if you want real whitespace or ``#`` characters in the pattern (outside a character class, where they are unaffected by ``/x``), you’ll either have to escape them or encode them using octal or hex escapes.
ru: Это также означает, что если вам нужно вставить пробел или символ ``#`` в шаблон (вне класса символов, где они не затрагиваются ``/x``), вам придется либо эскейпить их, либо кодировать, используя шестнадцатеричный код.

source: r, Russian ranges
ru: г, русские диапазоны

source: In Russian ASCII table characters ``ё``/``Ё`` are placed separately from others.
ru: В русской таблице ASCII символы ``ё`` / ``Ё`` размещаются отдельно от других.

source: Big and small Russian characters are in separated ranges, this is the same as with English characters but nevertheless I wanted some short form.
ru: Большие и маленькие русские символы находятся в отдельных диапазонах, это не отличается от ситуации с английскими символами, но, тем не менее, я хотел иметь краткую форму.

source: With this modifier instead of ``[а-яА-ЯёЁ]`` you can write ``[а-Я]`` if you need all Russian characters.
ru: С этим модификатором вместо ``[а-яА-ЯёЁ]`` вы можете написать ``[а-Я]``, если вам нужны все русские символы.

source: When the modifier is ``On``:
ru: Когда модификатор включен:

source: chars from ``а`` to ``я`` and ``ё``
ru: символы от ``а`` до ``я`` и ``ё``

source: chars from ``А`` to ``Я`` and ``Ё``
ru: символы от ``А`` до ``Я`` и ``Ё``

source: all russian symbols
ru: все русские символы

source: The modifier is set `On` by default.
ru: Модификатор по умолчанию установлен на ``Вкл``.

source: Assertions
ru: Проверки или заглядывания вперед и назад (Assertions)

source: Positive lookahead assertion: ``foo(?=bar)`` matches "foo" only before "bar", and "bar" is excluded from the match.
ru: Заглядывание вперед (lookahead assertion) ``foo(?=bar)`` совпадает "foo" только перед "bar", при этом сама строка "bar" не войдет в найденный текст.

source: Negative lookahead assertion: ``foo(?!bar)`` matches "foo" only if it's not followed by "bar".
ru: Отрицательное заглядывание вперед (negative lookahead assertion): ``foo(?!bar)`` совпадает "foo" только если после этой строки не следует "bar".

source: Positive lookbehind assertion: ``(?<=foo)bar`` matches "bar" only after "foo", and "foo" is excluded from the match.
ru: Ретроспективная проверка (lookbehind assertion): ``(?<=foo)bar`` совпадает "bar" только после "foo", при этом сама строка "foo" не войдет в найденный текст.

source: Negative lookbehind assertion: ``(?<!foo)bar`` matches "bar" only if it's not prefixed with "foo".
ru: Отрицательное заглядывание вперед (negative lookahead assertion): ``foo(?!bar)`` совпадает "bar" только если перед этой строки нет "foo".

source: Limitations:
ru: Ограничения:

source: Brackets for lookahead must be at the very ending of expression, and brackets for lookbehind must be at the very beginning. So assertions between choices ``|``, or inside groups, are not supported.
ru: Скобки для заглядываний вперед должны быть в самом начале выражения. Не поддерживаются заглядывания внутри альтернатив (``|``) или групп.

source: For lookbehind ``(?<!foo)bar``, regex "foo" must be of fixed length, ie contains only operations of fixed length matches. Quantifiers are not allowed, except braces with the repeated numbers ``{n}`` or ``{n,n}``. Char-classes are allowed here, dot is allowed, ``\b`` and ``\B`` are allowed. Groups and choices are not allowed.
ru: Для заглядывания назад ``(?<!foo)bar``, выражение "foo" должно быть фиксированной длины. Допустимы повторы только с фиксированным числом ``{n}`` или ``{n,n}``. Разрешено использование классов символов и точки. Не разрешены группы и альтернативы.

source: For other 3 assertion kinds, expression in brackets can be of any complexity.
ru: Для остальных трех типов заглядываний, выражение в скобках может быть сколь угодно сложным.

source: Non-capturing Groups
ru: Не захватываемые группы (подвыражения)

source: Syntax is like this: ``(?:expr)``.
ru: Синтаксис: ``(?:subexpression)``.

source: Such groups do not have the "index" and are invisible for backreferences. Non-capturing groups are used when you want to group a subexpression, but you do not want to save it as a matched/captured portion of the string. So this is just a way to organize your regex into subexpressions without overhead of capturing result:
ru: У этих групп (подвыражений) нет номера, их нельзя указать в ссылке на группу. Эти группы используют чтобы за счет группировки сделать регулярное выражение более читаемым, но нет необходимости расходовать ресурсы на то, чтобы реально отдельно захватывать то, с чем такие группы совпадут:

source: in ``https://sorokin.engineer`` matches ``https`` and ``sorokin.engineer``
ru: в ``https://sorokin.engineer`` захватит подвыражения ``https`` и ``sorokin.engineer``

source: in ``https://sorokin.engineer`` matches only ``sorokin.engineer``
ru: в ``https://sorokin.engineer`` захватит только ``sorokin.engineer``

source: Atomic Groups
ru: Атомарные группы

source: Syntax is like this: ``(?>expr|expr|...)``.
ru: Синтаксис: ``(?>expr|expr|...)``.

source: Atomic groups are special case of non-capturing groups. `Description of them. <https://regular-expressions.mobi/atomic.html?wlr=1>`__
ru: Атомарные группы это специальный случай незахватывающих групп. `Подробнее <https://regular-expressions.mobi/atomic.html?wlr=1>`__

source: Inline Modifiers
ru: Модификаторы

source: Syntax for one modifier: ``(?i)`` to turn on, and ``(?-i)`` to turn off. Many modifiers are allowed like this: ``(?msgxr-imsgxr)``.
ru: Синтаксис для одного модификатора: ``(?i)`` чтобы включить, и ``(?-i)`` чтобы выключить. Для большого числа модификаторов используется синтаксис: ``(?msgxr-imsgxr)``.

source: You may use it inside regular expression for modifying modifiers on-the-fly. This can be especially handy because it has local scope in a regular expression. It affects only that part of regular expression that follows ``(?imsgxr-imsgxr)`` operator.
ru: Можно использовать внутри регулярного выражения. Это может быть особенно удобно, поскольку оно имеет локальную область видимости. Оно влияет только на ту часть регулярного выражения, которая следует за оператором ``(?imsgxr-imsgxr)``.

source: And if it's inside group, it will affect only this group - specifically the part of the group that follows the modifiers. So in ``((?i)Saint)-Petersburg`` it affects only group ``((?i)Saint)`` so it will match ``saint-Petersburg`` but not ``saint-petersburg``.
ru: И если оно находится внутри подвыражения, оно будет влиять только на это подвыражение, а именно на ту часть подвыражения, которая следует за оператором. Таким образом, в ``((?i)Saint)-Petersburg`` это влияет только на подвыражение ``((?i)Saint)``, поэтому оно будет соответствовать ``saint-Petersburg``, но не ``saint-petersburg``.

source: ``Saint-petersburg`` and ``Saint-Petersburg``
ru: ``Saint-petersburg`` и ``Saint-Petersburg``

source: ``Saint-Petersburg`` but not ``Saint-petersburg``
ru: ``Saint-Petersburg``, но не ``Saint-petersburg``

source: ``Saint-petersburg`` and ``saint-petersburg``
ru: ``Saint-petersburg`` и ``saint-petersburg``

source: ``saint-Petersburg``, but not ``saint-petersburg``
ru: ``saint-Petersburg``, но не ``saint-petersburg``

source: Comments
ru: Комментарии

source: Syntax is like this: ``(?#text)``. Text inside brackets is ignored.
ru: Синтаксис: ``(?#text)``. Все, что внутри скобок, игнорируется.

source: Note that the comment is closed by the nearest ``)``, so there is no way to put a literal ``)`` in the comment.
ru: Обратите внимание, что комментарий закрывается ближайшим ``)``, поэтому нет способа вставить литерал ``)`` в комментарий.

source: Recursion
ru: Рекурсия

source: Syntax is ``(?R)``, the alias is ``(?0)``.
ru: Синтаксис ``(?R)``, синоним ``(?0)``.

source: The regex ``a(?R)?z`` matches one or more letters "a" followed by exactly the same number of letters "z".
ru: Выражение ``a(?R)?z`` совпадает с одним или более символом "a" за которым следует точно такое же число символов "z".

source: The main purpose of recursion is to match balanced constructs or nested constructs. The generic regex is ``b(?:m|(?R))*e`` where "b" is what begins the construct, "m" is what can occur in the middle of the construct, and "e" is what occurs at the end of the construct.
ru: Основное назначение рекурсии - сбалансировать обрамление вложенного текста. Общий вид ``b(?:m|(?R))*e`` где "b" это то что начинает обрамляемый текст, "m" это собственно текст, и "e" это то, что завершает обрамление.

source: If what may appear in the middle of the balanced construct may also appear on its own without the beginning and ending parts then the generic regex is ``b(?R)*e|m``.
ru: Если же обрамляемый текст также может встречаться без обрамления то выражение будет ``b(?R)*e|m``.

source: Subroutine calls
ru: Вызовы подвыражений

source: Syntax for call to numbered groups: ``(?1)`` ... ``(?90)`` (maximal index is limited by code).
ru: Нумерованные группы (подвыражения) обозначают ``(?1)`` ... ``(?90)`` (максимальное число групп определяется константой в TRegExpr).

source: Syntax for call to named groups: ``(?P>name)``. Also Perl syntax is supported: ``(?&name)``.
ru: Синтаксис для именованных групп : ``(?P>name)``. Поддерживается также Perl вариант синтаксиса: ``(?&name)``.

source: This is like recursion but calls only code of capturing group with specified index.
ru: Это похоже на рекурсию, но повторяет только указанную группу (подвыражение).

source: Unicode Categories
ru: Unicode категории (category)

source: Unicode standard has names for character categories. These are 2-letter strings. For example "Lu" is uppercase letters, "Ll" is lowercase letters. And 1-letter bigger category "L" is all letters.
ru: В стандарте Unicode есть именованные категории символов (Unicode category). Категория обозначается одной буквой, и еще одна добавляется, чтобы указать подкатегорию. Например "L" это буква в любом регистре, "Lu" - буквы в верхнем регистре, "Ll" - в нижнем.

source: Cf - Format
ru: Cf - Формат

source: Co - Private Use
ru: Co - Частное использование

source: Cs - Surrrogate
ru: Cs - Заменитель (Surrrogate)

source: Ll - Lowercase Letter
ru: Ll - Буква нижнего регистра

source: Lm - Modifier Letter
ru: Lm - Буква-модификатор

source: Lo - Other Letter
ru: Lo - Прочие буквы

source: Lu - Uppercase Letter
ru: Lu - Буква в верхнем регистре

source: Mc - Spacing Mark
ru: Mc - Разделитель

source: Me - Enclosing Mark
ru: Me - Закрывающий знак (Enclosing Mark)

source: Mn - Nonspacing Mark
ru: Mn - Несамостоятельный символ, как умляут над буквой (Nonspacing Mark)

source: Nd - Decimal Number
ru: Nd - Десятичная цифра

source: Nl - Letter Number
ru: Nl - Буквенная цифра - например, китайская, римская, руническая и т.д. (Letter Number)

source: No - Other Number
ru: No - Другие цифры

source: Sm - Math Symbol
ru: Sm - Математический символ

source: So - Other Symbol
ru: So - Прочие символы

source: Zl - Line Separator
ru: Zl - Разделитель строк

source: Zp - Paragraph Separator
ru: Zp - Разделитель параграфов

source: Meta-character ``\p`` denotes one Unicode char of specified category. Syntaxes: ``\pL`` and ``\p{L}`` for 1-letter name, ``\p{Lu}`` for 2-letter names.
ru: Метасимвол ``\p`` это один символ указанной Unicode категории (category). Синтаксис: ``\pL`` или ``\p{L}`` если категория обозначается одним символом, ``\p{Lu}`` для 2-символьных категорий.

source: Meta-character ``\P`` is inverted, it denotes one Unicode char **not** in the specified category.
ru: Метасимвол ``\P`` это символ **не** из Unicode категории (category).

source: These meta-characters are supported withing character classes too.
ru: Эти метасимволы также поддерживаются внутри пользовательских классов.

source: Afterword
ru: Послесловие

source: In this `ancient blog post from previous century <https://sorokin.engineer/posts/en/text_processing_from_birds_eye_view.html>`__ I illustrate some usages of regular expressions.
ru: В этой `древней статье из прошлого века <https://sorokin.engineer/posts/ru/text_processing_from_birds_eye_view.html>`__ есть примеры использования регулярных выражений.
