Repository: atkins126/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/regular_expressions.po
Languages: ru

source: English
ru: `English <https://regex.sorokin.engineer/en/latest/regular_expressions.html>`__

source: `Русский <https://regex.sorokin.engineer/ru/latest/regular_expressions.html>`__
ru: Русский

source: Regular expressions (RegEx)
ru: Регулярные выражения (RegEx)

source: Introduction
ru: Вступление

source: Regular expressions are a handy way to specify patterns of text.
ru: Регулярные выражения - удобный способ описывать шаблоны текстов.

source: With regular expressions you can validate user input, search for some patterns like emails of phone numbers on web pages or in some documents and so on.
ru: С помощью регулярных выражений вы можете проверять пользовательский ввод, искать некоторые шаблоны, такие как электронные письма телефонных номеров на веб-страницах или в некоторых документах и так далее.

source: Below is the complete regular expressions cheat sheet.
ru: Ниже приведена исчерпывающая шпаргалка по регулярных выражениям всего на одной странице.

source: Characters
ru: Символы

source: Simple matches
ru: Простые совпадения

source: Any single character (except special regex characters) matches itself. A series of (not special) characters matches that series of characters in the input string.
ru: Серия символов соответствует этой серии символов во входной строке.

source: Matches
ru: Находит

source: Non-Printable Characters (escape-codes)
ru: Непечатные символы (escape-коды)

source: To specify character by its Unicode code, use the prefix ``\x`` followed by the hex code. For 3-4 digits code (after U+00FF), enclose the code into braces.
ru: Для представления непечатаемого символа в регулярном выражении используется ``\x`` с шестнадцатеричным кодом. Если код длиннее 2 цифр (более U+00FF), то он обрамляется в фигурные скобки.

source: character with 2-digit hex code ``AB``
ru: символ с 2-значным шестнадцатеричным кодом ``AB``

source: character with 1..4-digit hex code ``AB20``
ru: символ с 1-4 значным шестнадцатеричным кодом ``AB20``

source: ``foo bar`` (note space in the middle)
ru: ``foo bar`` (обратите внимание на пробел в середине)

source: There are a number of predefined escape-codes for non-printable characters, like in C language:
ru: Существует ряд предопределенных ``escape-кодов`` для непечатных символов, как в языке ``C``:

source: tab (HT/TAB), same as ``\x09``
ru: tab (HT/TAB), тоже что ``\x09``

source: line feed (LF), same as ``\x0a``
ru: символ новой строки (LF), то же что ``\x0a``

source: carriage return (CR), same as ``\x0d``
ru: возврат каретки (CR), тоже что ``\x0d``

source: form feed (FF), same as ``\x0c``
ru: form feed (FF), то же что ``\x0c``

source: alarm (BEL), same as ``\x07``
ru: звонок (BEL), тоже что ``\x07``

source: escape (ESC), same as ``\x1b``
ru: escape (ESC), то же что ``\x1b``

source: chr(0) to chr(25).
ru: chr(0) по chr(25).

source: For example, ``\cI`` matches the tab-char.
ru: Например ``\cI`` соответствует табуляции.

source: Lower-case letters "a"..."z" are also supported.
ru: Также поддерживаются буквы в нижнем регистре "a"..."z".

source: Escaping
ru: Эскейпинг

source: To represent special regex character (one of ``.+*?|\()[]{}^$``), prefix it with a backslash ``\``. The literal backslash must be escaped too.
ru: Для представления спецсимволов (``.+*?|\()[]{}^$``), перед ними надо поставить ``\``. Чтобы вставить сам обратный слэш его надо удвоить.

source: ``^FooBarPtr``, this is ``^`` and not `start of line <#lineseparators>`__
ru: ``^FooBarPtr`` здесь ``^`` не означает `начало строки <#lineseparators>`__

source: ``[a]``, this is not `character class <#userclass>`__
ru: ``[a]`` это не `класс символов <#userclass>`__

source: Character Classes
ru: Классы символов

source: User Character Classes
ru: Пользовательские классы

source: Character class is a list of characters inside square brackets ``[]``. The class matches any **single** character listed in this class.
ru: Символьный класс - это список символов внутри ``[]``. Класс соответствует любому **одному** символу, указанному в этом классе.

source: ``foobar``, ``foober`` etc but not ``foobbr``, ``foobcr`` etc
ru: ``foobar``, ``foober`` и т. д., но не ``foobbr``, ``foobcr`` и т. д.

source: You can "invert" the class - if the first character after the ``[`` is ``^``, then the class matches any character **except** the characters listed in the class.
ru: Вы можете ``инвертировать`` класс - если первый символ после ``[`` является ``^``, то класс соответствует любому символу, **кроме** символов, перечисленных в классе.

source: ``foobbr``, ``foobcr`` etc but not ``foobar``, ``foober`` etc
ru: ``foobbr``, ``foobcr`` и т. д., но не ``foobar``, ``foober`` и т. д.

source: Within a list, the dash ``-`` character is used to specify a range, so that ``a-z`` represents all characters between ``a`` and ``z``, inclusive.
ru: Внутри списка символ ``-`` используется для указания диапазона, так что ``a-z`` представляет все символы между ``a`` и ``z`` включительно.

source: If you want the dash ``-`` itself to be a member of a class, put it at the start or end of the list, or `escape <#escape>`__ it with a backslash.
ru: Если вы хотите, чтобы ``-`` сам был членом класса, поместите его в начало или конец списка или предварите его обратной косой чертой (`escape <#escape>`__).

source: If you want ``]`` as part of the class you may place it at the start of list or `escape <#escape>`__ it with a backslash.
ru: Если вы хотите буквально использовать символ ``]`` поместите его в начало списка или `escape <#escape>`__ обратной косой чертой.

source: ``a``, ``z`` and ``-``
ru: ``a``, ``z`` и ``-``

source: ``[a\-z]``
ru: ``[А\-z]``

source: characters from ``a`` to ``z``
ru: символы от ``a`` до ``z``

source: characters from chr(10) to chr(13)
ru: символы от ``#10`` до ``#13``

source: Meta-Classes
ru: Метаклассы

source: There are a number of predefined character classes that keeps regular expressions more compact, "meta-classes":
ru: Существует ряд предопределенных классов символов, которые делают регулярные выражения более компактными. Их называют метаклассы:

source: an alphanumeric character, including ``_``
ru: буквенно-цифровой символ (включая ``_``)

source: a non-alphanumeric
ru: не буквенно-цифровой

source: a numeric character (same as ``[0-9]``)
ru: числовой символ (тоже, что ``[0-9]``)

source: a non-numeric
ru: нечисловой

source: any space (same as ``[ \t\n\r\f]``)
ru: любой пробел (такой же как ``[\t\n\r\f]``)

source: a non-space
ru: не пробел

source: horizontal whitespace: the tab and all characters
ru: горизонтальный разделитель. Табуляция, пробел и все символы

source: in the "space separator" Unicode category
ru: в Unicode категории "разделители" (space separator Unicode category)

source: not a horizontal whitespace
ru: не горизонтальный разделитель

source: vertical whitespace: all characters treated as
ru: вертикальные разделители. новая строка и все символы

source: line-breaks in the Unicode standard
ru: "разделители строк" в Unicode

source: not a vertical whitespace
ru: не вертикальный разделитель

source: You may use all meta-classes, mentioned in the table above, within `user character classes <User Character Classes_>`_.
ru: Все указанные в таблице метаклассы можно использовать внутри `пользовательских классов <User Character Classes_>`_.

source: ``foob1r``, ``foob6r`` and so on, but not ``foobar``, ``foobbr`` and so on
ru: ``foob1r``, ``foob6r`` и т. д., но не ``foobar``, ``foobbr`` и т. д.

source: ``foobar``, ``foob r``, ``foobbr`` and so on, but not ``foob1r``, ``foob=r`` and so on
ru: ``foobar``, ``foob r``, ``foobbr`` и т. д., но не ``foob1r``, ``foob=r`` и т. д.

source: Properties `SpaceChars <tregexpr.html#spacechars>`_ and `WordChars <tregexpr.html#wordchars>`_ define character classes ``\w``, ``\W``, ``\s``, ``\S``.
ru: Свойства `SpaceChars <tregexpr.html#spacechars>`_ и `WordChars <tregexpr.html#wordchars>`_ определяют, какие символы входят в классы ``\w``, ``\W``, ``\s``, ``\S``.

source: So you can redefine these classes.
ru: Таким образом, вы можете переопределить эти классы.

source: Boundaries
ru: Разделители

source: Line Boundaries
ru: Разделители строк

source: Meta-char
ru: Метасимвол

source: any character, can include line-breaks
ru: любой символ в строке, может включать разделители строк

source: zero-length match at start of line
ru: совпадение нулевой длины в начале строки

source: zero-length match at end of line
ru: совпадение нулевой длины в конце строки

source: zero-length match at the very beginning
ru: совпадение нулевой длины в начале строки

source: zero-length match at the very end
ru: совпадение нулевой длины в конце строки

source: like ``\z`` but also matches before the final line-break
ru: похож на ``\z`` но совпадает перед разделителем строки, а не сразу после него, как ``\z``

source: Examples:
ru: Примеры:

source: ``foobar`` only if it's at the beginning of line
ru: ``foobar`` только если он находится в начале строки

source: ``foobar`` only if it's at the end of line
ru: ``foobar``, только если он в конце строки

source: ``foobar`` only if it's the only string in line
ru: ``foobar`` только если это единственная строка в строке

source: ``foobar``, ``foobbr``, ``foob1r`` and so on
ru: ``foobar``, ``foobbr``, ``foob1r`` и так далее

source: Meta-char ``^`` matches zero-length position at the beginning of the input string. ``$`` - at the ending. If `modifier /m <#m>`_ is **on**, they also match at the beginning/ending of individual lines in the multi-line text.
ru: Метасимвол ``^`` совпадает с точкой начала строки (нулевой длины). ``$`` - в конце строки. Если включен `modifier /m <#m>`_ , они совпадают с началами или концами строк внутри текста.

source: Note that there is no empty line within the sequence ``\x0D\x0A``.
ru: Обратите внимание, что в последовательности ``\x0D\x0A`` нет пустой строки.

source: If you are using `Unicode version <tregexpr.html#unicode>`__, then ``^``/``$`` also matches ``\x2028``, ``\x2029``, ``\x0B``, ``\x0C`` or ``\x85``.
ru: Если вы используете `Unicode версию <tregexpr.html#unicode>`__, то ``^``/``$`` также соответствует ``\x2028``, ``\x2029``, ``\x0B``, ``\x0C`` или ``\x85``.

source: Meta-char ``\A`` matches zero-length position at the very beginning of the input string, ``\z`` - at the very ending. They ignore `modifier /m <#m>`_. ``\Z`` is like ``\z`` but also matches before the final line-break (LF and CR LF). Behaviour of ``\A``, ``\z``, ``\Z`` is made like in most of major regex engines (Perl, PCRE, etc).
ru: Метасимвол ``\A`` совпадает с точкой нулевой длины в начале строки, ``\z`` - в конце (после символов завершения строки). Модификатор `modifier /m <#m>`_ на них не влияет. ``\Z`` тоже самое что ``\z`` но совпадает с точкой перед символами завершения строки (LF and CR LF).

source: Meta-char ``.`` (dot) by default matches any character, but if you turn **off** the `modifier /s <#s>`_, then it won't match line-breaks inside the string.
ru: Метасимвол ``.`` по умолчанию соответствует любому символу, но если вы выключите `modifier /s <#s>`_, то ``.`` не будет совпадать с разделителями строк внутри строки.

source: Note that ``^.*$`` does not match a string between ``\x0D\x0A``, because this is unbreakable line separator. But it matches the empty string within the sequence ``\x0A\x0D`` because this is 2 line-breaks in the wrong order.
ru: Обратите внимание, что выражение ``^.*$`` не соответствует точке между ``\x0D\x0A``, потому что это неразрывный разделитель строк. Но оно соответствует пустой строке в последовательности ``\x0A\x0D``, поэтому из-за неправильного порядка кодов он не воспринимается как разделитель строк и считается просто двумя символами.

source: Multi-line processing can be tuned by properties `LineSeparators <tregexpr.html#lineseparators>`__ and `UseLinePairedBreak <tregexpr.html#linepairedseparator>`_.
ru: Многострочная обработка может быть настроена с помощью свойств `LineSeparators <tregexpr.html#lineseparators>`__ и `LinePairedSeparator <tregexpr.html#linepairedseparator>`_.

source: So you can use Unix style separators ``\n`` or DOS/Windows style ``\r\n`` or mix them together (as in described above default behaviour).
ru: Таким образом, вы можете использовать разделители стиля Unix ``\n`` или стиль DOS / Windows ``\r\n`` или смешивать их вместе (как описано выше по умолчанию).

source: If you prefer mathematically correct description you can find it on `www.unicode.org <http://www.unicode.org/unicode/reports/tr18/>`__.
ru: Если вы предпочитаете математически правильное описание, вы можете найти его на сайте `www.unicode.org <http://www.unicode.org/versions/latest/>`__.

source: Word Boundaries
ru: Разделители слов

source: a word boundary
ru: разделитель слов

source: a non-word boundary
ru: разделитель с **не**-словом

source: A word boundary ``\b`` is a spot between two characters that has a ``\w`` on one side of it and a ``\W`` on the other side of it (in either order).
ru: Граница слова ``\b`` - это точка между двумя символами, у которой ``\w`` с одной стороны от нее и ``\W`` с другой стороны (в любом порядке).

source: Quantification
ru: Повторы

source: Quantifiers
ru: Повтор

source: Any item of a regular expression may be followed by quantifier. Quantifier specifies number of repetition of the item.
ru: За любым элементом регулярного выражения может следовать допустимое число повторений элемента.

source: exactly ``n`` times
ru: ровно ``n`` раз

source: at least ``n`` times
ru: по крайней мере ``n`` раз

source: at least ``n`` but not more than ``m`` times
ru: по крайней мере ``n``, но не более чем ``m`` раз

source: zero or more, similar to ``{0,}``
ru: ноль или более, аналогично ``{0,}``

source: one or more, similar to ``{1,}``
ru: один или несколько, похожие на ``{1,}``

source: zero or one, similar to ``{0,1}``
ru: ноль или единица, похожая на ``{0,1}``

source: So, digits in curly brackets ``{n,m}``, specify the minimum number of times to match ``n`` and the maximum ``m``.
ru: То есть цифры в фигурных скобках ``{n,m}`` определяются минимальное ``n`` и максимальное ``m`` количество повторов (совпадений во входном тексте).

source: The ``{n}`` is equivalent to ``{n,n}`` and matches exactly ``n`` times. The ``{n,}`` matches ``n`` or more times.
ru: ``{n}`` эквивалентно ``{n,n}`` и означает ``точно n раз``. ``{n,}`` совпадает ``n`` или более раз.

source: There is no practical limit to the values n and m (limit is maximal signed 32-bit value).
ru: Теоретически значение n и m не ограничены (можно использовать максимальное значение для 32-х битного числа).

source: ``foobar``, ``foobalkjdflkj9r`` and ``foobr``
ru: ``foobar``, ``foobalkjdflkj9r`` и ``foobr``

source: ``foobar``, ``foobalkjdflkj9r`` but not ``foobr``
ru: ``foobar``, ``foobalkjdflkj9r``, но не ``foobr``

source: ``foobar``, ``foobbr`` and ``foobr`` but not ``foobalkj9r``
ru: ``foobar``, ``foobbr`` и ``foobr``, но не ``foobalkj9r``

source: ``foobaar'``, ``foobaaar``, ``foobaaaar`` etc.
ru: ``foobaar``, ``foobaaar``, ``foobaaaar`` и т. д.

source: ``foobaar``, or ``foobaaar`` but not ``foobaaaar``
ru: ``foobaar``, или ``foobaaar``, но не ``foobaaaar``

source: 8...10 instances of ``foobar`` (``()`` is `group <#subexpression>`__)
ru: ``8``, ``9`` или ``10`` экземпляров ``foobar`` (``()`` это `Группа <#subexpression>`__)

source: Greediness
ru: Жадность

source: `Quantifiers <#iterator>`_ in "greedy" mode takes as many as possible, in "lazy" mode - as few as possible.
ru: `Повторы <#iterator>`_ в ``жадном`` режиме захватывают как можно больше из входного текста, в ``не жадном`` режиме - как можно меньше.

source: By default all quantifiers are "greedy". Append the character ``?`` to make any quantifier "lazy".
ru: По умолчанию все повторы являются ``жадными``. Используйте ``?`` Чтобы сделать любой повтор ``не жадным``.

source: For string ``abbbbc``:
ru: Для строки ``abbbbc``:

source: ``b+?``
ru: ``Ь+?``

source: empty string
ru: пустую строку

source: You can switch all quantifiers into "lazy" mode (`modifier /g <#g>`_, below we use `in-line modifier change <#inlinemodifiers>`_).
ru: Вы можете переключить все повторы в ``не жадный`` режим (`modifier /g <#g>`_, ниже мы используем `in-line модификатор change <#inlinemodifiers>`_).

source: ``(?-g)b+``
ru: ``(?-g)Ь+``

source: Possessive Quantifier
ru: Сверхжадные повторы (Possessive Quantifier)

source: The syntax is: ``a++``, ``a*+``, ``a?+``, ``a{2,4}+``. Currently it's supported only for simple braces, but not for braces after group like ``(foo|bar){3,5}+``.
ru: Синтаксис: ``a++``, ``a*+``, ``a?+``, ``a{2,4}+``. В настоящее время реализован только для простых групп и не будет работать для сложны, как например ``(foo|bar){3,5}+``.

source: This regex feature is `described here. <https://regular-expressions.mobi/possessive.html?wlr=1>`__ In short, possessive quantifier speeds up matching in complex cases.
ru: `Полное описание (на английском) <https://regular-expressions.mobi/possessive.html?wlr=1>`__ Вкратце, сверхжадный повтор ускоряет работу в сложных случаях.

source: Choice
ru: Альтернативы

source: Expressions in the choice are separated by vertical bar ``|``.
ru: Выражения в списке альтернатив разделяются ``|``.

source: So ``fee|fie|foe`` will match any of ``fee``, ``fie``, or ``foe`` in the target string (as would ``f(e|i|o)e``).
ru: Таким образом, ``fee|fie|foe`` будет соответствовать любому из ``fee``, ``fie`` или ``foe`` (также как и ``f(e|i|o)e``).

source: The first expression includes everything from the last pattern delimiter (``(``, ``[``, or the beginning of the pattern) up to the first ``|``, and the last expression contains everything from the last ``|`` to the next pattern delimiter.
ru: Первое выражение включает в себя все от последнего разделителя шаблона (``(``, ``[`` или начало шаблона) до первого ``|``, а последнее выражение содержит все от последнего ``|`` к следующему разделителю шаблона.

source: Sounds a little complicated, so it’s common practice to include the choice in parentheses, to minimize confusion about where it starts and ends.
ru: Звучит сложно, поэтому обычной практикой является заключение списка альтернатив в скобки, чтобы минимизировать путаницу относительно того, где он начинается и заканчивается.

source: Expressions in the choice are tried from left to right, so the first expression that matches, is the one that is chosen.
ru: Выражения в списке альтернатив пробуются слева направо, принимается первое же совпадение.

source: For example, regular expression ``foo|foot`` in string ``barefoot`` will match ``foo``. Just a first expression that matches.
ru: Например, регулярное выражение ``foo|foot`` в строке ``barefoot`` будет соответствовать ``foo`` - первое же совпадение.

source: Also remember that ``|`` is interpreted as a literal within square brackets, so if you write ``[fee|fie|foe]`` you’re really only matching ``[feio|]``.
ru: Также помните, что ``|`` в квадратных скобках воспринимается просто как символ, поэтому, если вы напишите ``[fee|fie|foe]``, это тоже самое что ``[feio|]``.

source: ``foobar`` or ``foofoo``
ru: ``foobar`` или ``foofoo``

source: Groups
ru: Группы (подвыражения)

source: The brackets ``()`` are used to define groups (ie subexpressions).
ru: Скобки ``(...)`` также могут использоваться для определения групп (подвыражений) регулярного выражения.

source: Group positions, lengths and actual values will be in `MatchPos <tregexpr.html#matchpos>`_, `MatchLen <tregexpr.html#matchlen>`_ and `Match <tregexpr.html#match>`_.
ru: Позиция, длина и фактические значения подвыражений будут в `MatchPos <tregexpr.html#matchpos>`_, `MatchLen <tregexpr.html#matchlen>`_ и `Match <tregexpr.html#match>`_.

source: You can substitute them with `Substitute <tregexpr.html#substitute>`_.
ru: Вы можете заменить их с помощью функции `Substitute <tregexpr.html#substitute>`_.

source: Groups are numbered from left to right by their opening parenthesis (including nested groups). First group has index 1. The entire regex has index 0.
ru: Подвыражения нумеруются слева направо по открывающим их скобкам (включая вложенные группы (подвыражения). У первой группы номер 1. У выражения в целом - 0.

source: For string ``foobar``, the regex ``(foo(bar))`` will find:
ru: Например, для входной строки ``foobar`` регулярное выражение ``(foo(bar))`` найдет:

source: Group
ru: Группы (подвыражения)

source: Value
ru: значение

source: Backreferences
ru: Ссылки на группы (Backreferences)

source: Meta-chars ``\1`` through ``\9`` are interpreted as backreferences to groups. They match the previously found group with the specified index.
ru: Метасимволы от ``\1`` до ``\9`` интерпретируются как ссылки на группы (подвыражения в ``()``). ``\n`` соответствует ранее найденному подвыражению ``n``.

source: ``aaaa`` and ``cc``
ru: ``aaaa`` и ``cc``

source: also ``abab`` and ``123123``
ru: также ``abab`` и ``123123``

source: RegEx ``(['"]?)(\d+)\1`` matches ``"13"`` (in double quotes), or ``'4'`` (in single quotes) or ``77`` (without quotes) etc.
ru: ``(['"]?)(\d+)\1`` соответствует ``"13"`` (в двойных кавычках) или ``'4'`` (в одинарных кавычках) или ``77`` (без кавычек) и т. д.

source: Named Groups and Backreferences
ru: Именованные группы (подвыражения) и ссылки на них

source: To make some group named, use this syntax: ``(?P<name>expr)``. Also Perl syntax is supported: ``(?'name'expr)``.
ru: Чтобы присвоить имя группе используйте ``(?P<name>expr)`` или ``(?'name'expr)``.

source: Name of group must be valid identifier: first char is letter or "_", other chars are alphanumeric or "_". All named groups are also usual groups and share the same numbers 1 to 9.
ru: Имя группы должно начинаться с буквы или ``_``, далее следуют буквы, цифры или ``_``. Именованные и не именованные группы имеют общую нумерацию от ``1`` до ``9``.

source: Backreferences to named groups are ``(?P=name)``, the numbers ``\1`` to ``\9`` can also be used.
ru: Чтобы сослаться на именованную группу используйте ``(?P=name)``. Или, как и для не именованных, цифры от ``\1`` до ``\9``.

source: ``"word"`` and ``'word'``
ru: ``"word"`` и ``'word'``

source: Modifiers
ru: Модификаторы

source: Modifiers are for changing behaviour of regular expressions.
ru: Модификаторы предназначены для изменения поведения регулярных выражений.

source: You can set modifiers globally in your system or change inside the regular expression using the `(?imsxr-imsxr) <#inlinemodifiers>`_.
ru: Вы можете установить модификаторы глобально в вашей системе или изменить их внутри регулярного выражения, используя `(?imsxr-imsxr) <#inlinemodifiers>`_.

source: To change modifiers use `ModifierStr <tregexpr.html#modifierstr>`__ or appropriate ``TRegExpr`` properties `Modifier* <tregexpr.html#modifieri>`__.
ru: Для изменения модификаторов используйте `ModifierStr <tregexpr.html#modifierstr>`__ или соответствующие ``TRegExpr`` свойства `Модификатор * <tregexpr.html#modifieri>`__.

source: The default values are defined in `global variables <tregexpr.html#global-constants>`_. For example global variable ``RegExprModifierX`` defines default value for ``ModifierX`` property.
ru: Значения по умолчанию определены в `глобальных переменных <tregexpr.html#global-constants>`_. Скажем, глобальная переменная ``RegExprModifierX`` определяет значение по умолчанию для свойства ``ModifierX``.

source: i, case-insensitive
ru: i, без учета регистра

source: Case-insensitive. Use installed in you system locale settings, see also `InvertCase <tregexpr.html#invertcase>`__.
ru: Регистро-независимые сравнения. Использует установленные в вашей системе языковые настройки, см. также `InvertCase <tregexpr.html#invertcase>`__.

source: m, multi-line strings
ru: m, многострочные строки
